In [3]:
import numpy as np
import pandas as pd

In [4]:
#1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.
data = [1, 2, 3, 4, 5] 
print(f"N_ARR = {data} Type = {type(data)}")
s_series  = pd.Series(data)
print(s_series)

N_ARR = [1, 2, 3, 4, 5] Type = <class 'list'>
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
#2. Write a Pandas program to convert a Panda module Series to Python list and itâ€™s type.
def function2():
    n_series = pd.Series([10,20,30,40,50,60])
    print("Pandas Series and type")
    print(n_series)
    print(type(n_series))
    print("Convert Pandas Series to Python list")
    print(n_series.tolist())
    print(type(n_series.tolist()))
function2()

Pandas Series and type
0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64
<class 'pandas.core.series.Series'>
Convert Pandas Series to Python list
[10, 20, 30, 40, 50, 60]
<class 'list'>

In [6]:
#3 Write a Pandas program to add, subtract, multiple and divide two Pandas Series. Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]
import pandas as pd
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
ds = ds1 + ds2
print("Add two Series:")
print(ds)
print("Subtract two Series:")
ds = ds1 - ds2
print(ds)
print("Multiply two Series:")
ds = ds1 * ds2
print(ds)
print("Divide Series1 by Series2:")
ds = ds1 / ds2
print(ds)

Add two Series:
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtract two Series:
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiply two Series:
0     2
1    12
2    30
3    56
4    90
dtype: int64
Divide Series1 by Series2:
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [7]:
#4. Write a Pandas program to convert a dictionary to a Pandas series.
s1 = pd.Series({"Name":"GYAN","COLLEGE":"SUNBEAM","course":"DESD"})
print(s1)

Name          GYAN
COLLEGE    SUNBEAM
course        DESD
dtype: object

In [8]:
#5. Write a Pandas program to convert a NumPy array to a Pandas series.
data = np.array(['a', 'b', 'c', 'd']) 
s = pd.Series(data) 
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [9]:
#6. Write a Pandas program to change the data type of given a column or a Series.
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
print("Original Data Series:")
print(s1)
print("Change the said data type to numeric:")
s2 = pd.to_numeric(s1, errors='coerce')
print(s2)

Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Change the said data type to numeric:
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

In [10]:
#7. Write a Pandas program to convert a given Series to an array.
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
print("Original Data Series:")
print(s1)
print("Series to an array")
a = s1.values
print(a)
print(type(a))

Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Series to an array
['100' '200' 'python' '300.12' '400']
<class 'numpy.ndarray'>

In [11]:
#8. Write a Pandas program to create a dataframe from a dictionary and display it.
def function():
    p1 = ({"name":"P1","age":25,"id":1234})
    p2 = ({"name":"P2","age":35,"id":456})
    p3 = ({"name":"P3","age":20,"marks":85})
    
    s1 = pd.Series(p1)
    s2 = pd.Series(p2)
    s3 = pd.Series(p3)
    df = pd.DataFrame([s1,s2,s3])
    
    print(df)
function()

  name  age      id  marks
0   P1   25  1234.0    NaN
1   P2   35   456.0    NaN
2   P3   20     NaN   85.0

In [12]:
# 9. i) Create a list of empids and names (10 employees).
#    ii) Convert list into Series.
#    iii) Print type of Series.
#    iv) Convert Series into DataFrame.
#    v) a) Display all records.
#       b) Display first five records.
#       c) Display last five records.
#       d) Display first two and last two records.
#       e) Display name of 5th employee.
#       f) Display record of 4th employee.
#    vi) Save the record in csv file (MyRecord.csv)

In [1]:
import pandas as pd

In [2]:
# Q9
# i) Create a list of empids and names (10 employees).
empid = [10001, 10002, 10003, 10004, 10005, 10006, 10007, 10008, 10009, 10010]
name = ['Abhishek', 'Bipin', 'Chetan', 'Deep', 'Ekta', 'Firoz', 'Gyan', 'Hari', 'Indra', 'Jitendra']

In [3]:
# ii) Convert list into Series.
emp_series = pd.Series(name, index=empid)

In [4]:
# iii) Print type of Series.
print("Type of Series:", type(emp_series))

Type of Series: <class 'pandas.core.series.Series'>

In [6]:
# iv) Convert Series into DataFrame.
emp_df = pd.DataFrame(emp_series, columns=['Name'])

In [7]:
# v) a) Display all records.
print("\nAll records:\n", emp_df)

All records:
            Name
10001  Abhishek
10002     Bipin
10003    Chetan
10004      Deep
10005      Ekta
10006     Firoz
10007      Gyan
10008      Hari
10009     Indra
10010  Jitendra

In [8]:
# v) b) Display first five records.
#print(f"\nDisplay first five records.\n = {emp_df[0:5]}") 

print("\nFirst five records:\n", emp_df.head())

# v) c) Display last five records.
#print(f"Display last five records. = {emp_df.tail(5)}")
print("\nLast five records:\n", emp_df.tail())

First five records:
            Name
10001  Abhishek
10002     Bipin
10003    Chetan
10004      Deep
10005      Ekta

Last five records:
            Name
10006     Firoz
10007      Gyan
10008      Hari
10009     Indra
10010  Jitendra

In [9]:
# v) d) Display first two and last two records.
print("\nFirst two and last two records:\n", pd.concat([emp_df.head(2), emp_df.tail(2)]))

# v) e) Display name of 5th employee.
print("\nName of 5th employee:", emp_df.iloc[4]['Name'])

# v) f) Display record of 4th employee.
print("\nRecord of 4th employee:\n", emp_df.iloc[3])

First two and last two records:
            Name
10001  Abhishek
10002     Bipin
10009     Indra
10010  Jitendra

Name of 5th employee: Ekta

Record of 4th employee:
 Name    Deep
Name: 10004, dtype: object

In [10]:
# vi) Save the record in csv file (MyRecord.csv)
emp_df.to_csv("MyRecord.csv", index_label="EmpID")
print("\n Records saved in csv file\n")

 Records saved in csv file

In [52]:
#10. i) Read the MyRecord.csv file.
emp_df = pd.read_csv("MyRecord.csv", index_col="EmpID")
   # ii) Create a new column Salary
salaries = [60000, 70000, 55000, 65000, 60000, 75000, 70000, 60000, 65000, 70000]
emp_df['Salary'] = salaries
print(emp_df)
emp_df.to_csv("MyRecord.csv", index_label="EmpID")

           Name  Salary
EmpID
10001  Abhishek   60000
10002     Bipin   70000
10003    Chetan   55000
10004      Deep   65000
10005      Ekta   60000
10006     Firoz   75000
10007      Gyan   70000
10008      Hari   60000
10009     Indra   65000
10010  Jitendra   70000

In [12]:
#make Advertising file
import pandas as pd
data = {
    'TV': [230.1, 44.5, 17.2, 151.5, 180.8, 55, 88.05, 66.33, 200, 500.5],
    'radio': [37.8, 39.3, 45.9, 41.3, 10.8, 66.55, 77.8, 88.8, 99.5, 101.1],
    'newspaper': [69.2, 45.1,58 , 58.5, 58.4, 66.2, 77.8, 88.9,99.1, 55.5],
    'sales': [22.1, 10.4, 9.3, 18.5, 12.9, 20, 19.5, 16.6, 17.7, 18.9]
}
df = pd.DataFrame(data)
df.to_csv("Advertising.csv", index=False)

print("Advertising.csv created successfully!")

Advertising.csv created successfully!

In [13]:
import pandas as pd

In [17]:
#Q 11. 

# i) Read the dataset "Advertising.csv" into a DataFrame.
df = pd.read_csv("Advertising.csv")

#ii) Print first five records of dataset.
print("First five records:")
df.head()

First five records:

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       58.0    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [18]:

# iii) Print last five records from dataset.
print("\nLast five records:")
df.tail()

Last five records:

       TV   radio  newspaper  sales
5   55.00   66.55       66.2   20.0
6   88.05   77.80       77.8   19.5
7   66.33   88.80       88.9   16.6
8  200.00   99.50       99.1   17.7
9  500.50  101.10       55.5   18.9

In [19]:
# iv) Display the columns inside the dataset.
print("\nColumns in the dataset:")
df.columns

Columns in the dataset:

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [23]:
# v) Display last three records from dataset.
print("\nLast three records:")
print(df.tail(3))

# vi) Display information about the dataset and analyze the data.
print("\nInformation about the dataset:")
df.info()

Last three records:
       TV  radio  newspaper  sales
7   66.33   88.8       88.9   16.6
8  200.00   99.5       99.1   17.7
9  500.50  101.1       55.5   18.9

Information about the dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         10 non-null     float64
 1   radio      10 non-null     float64
 2   newspaper  10 non-null     float64
 3   sales      10 non-null     float64
dtypes: float64(4)
memory usage: 448.0 bytes

In [24]:
# vii) Display types of each column.
print("\nTypes of each column:")
df.dtypes

Types of each column:

TV           float64
radio        float64
newspaper    float64
sales        float64
dtype: object

In [25]:
# viii) Check for null values in the dataset and display the sum of null values inside each column.
print("\nNull values in each column:")
df.isna().sum()

Null values in each column:

TV           0
radio        0
newspaper    0
sales        0
dtype: int64

In [26]:
# ix) Drop a column 'radio' from the dataset and display first ten records.
df.drop(columns=['radio'], inplace=True)
print("\nFirst ten records after dropping 'radio' column:")
print(df.head(10))

First ten records after dropping 'radio' column:
       TV  newspaper  sales
0  230.10       69.2   22.1
1   44.50       45.1   10.4
2   17.20       58.0    9.3
3  151.50       58.5   18.5
4  180.80       58.4   12.9
5   55.00       66.2   20.0
6   88.05       77.8   19.5
7   66.33       88.9   16.6
8  200.00       99.1   17.7
9  500.50       55.5   18.9

In [27]:
# x) Increase the sales by 10% and add a new column "updated_sales" in the DataFrame.
df['updated_sales'] = df['sales'] * 1.1
print("\nDataFrame with updated sales:")
df.head()

DataFrame with updated sales:

      TV  newspaper  sales  updated_sales
0  230.1       69.2   22.1          24.31
1   44.5       45.1   10.4          11.44
2   17.2       58.0    9.3          10.23
3  151.5       58.5   18.5          20.35
4  180.8       58.4   12.9          14.19

In [28]:
# xi) Display shape of data.
print("\nShape of data:", df.shape)

Shape of data: (10, 4)

In [29]:
# xii) Find out maximum, minimum, mean, median, standard deviation value of each column.
print("\nStatistics for each column:")
print(df.describe())

# xiii) Describe the dataset.
print("\nDescription of the dataset:")
print(df.describe(include='all'))

Statistics for each column:
               TV  newspaper      sales  updated_sales
count   10.000000  10.000000  10.000000      10.000000
mean   153.398000  67.670000  16.590000      18.249000
std    141.904212  16.555365   4.291451       4.720597
min     17.200000  45.100000   9.300000      10.230000
25%     57.832500  58.100000  13.825000      15.207500
50%    119.775000  62.350000  18.100000      19.910000
75%    195.200000  75.650000  19.350000      21.285000
max    500.500000  99.100000  22.100000      24.310000

Description of the dataset:
               TV  newspaper      sales  updated_sales
count   10.000000  10.000000  10.000000      10.000000
mean   153.398000  67.670000  16.590000      18.249000
std    141.904212  16.555365   4.291451       4.720597
min     17.200000  45.100000   9.300000      10.230000
25%     57.832500  58.100000  13.825000      15.207500
50%    119.775000  62.350000  18.100000      19.910000
75%    195.200000  75.650000  19.350000      21.285000
max    500.500000  99.100000  22.100000      24.310000

In [30]:
# 12. Refer the dataset "Salaries.csv" and perform following tasks.
# i) Read the dataset in dataframe.
df = pd.read_csv("Salary.csv")

In [31]:
# ii) display first five records.
print("First five records:")
df.head()

First five records:

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [32]:
# iii) display first ten records.
print("ten records:")
df.head(10)

ten records:

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

In [33]:
# iv) display last five records.
print("last five records:")
print(df.tail(5))

# v) display last ten records.
print("last ten records:")
df.tail(10)

last five records:
    YearsExperience  Salary
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000
last ten records:

    YearsExperience  Salary
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [34]:
# vi) display the columns inside the dataset.
print("\nColumns in the dataset:")
print(df.columns)

# vii) display shape of data.
print("\nShape of data:", df.shape)

Columns in the dataset:
Index(['YearsExperience', 'Salary'], dtype='object')

Shape of data: (33, 2)

In [35]:
# viii) describe the dataset.
print("\nDescription of the dataset:")
print(df.describe(include='all'))

# ix) display the information about the dataset and analyse the data.
print("\nInformation about the dataset:")
df.info()

Description of the dataset:
       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

Information about the dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  33 non-null     float64
 1   Salary           33 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 656.0 bytes

In [36]:
# x) display types of each columns.print("\nTypes of each column:")
print(df.dtypes)

# xi) Find out maximum,minimum,mean,median,standard deviation value of each column.
print("\nStatistics for each column:")
print(df.describe())

YearsExperience    float64
Salary               int64
dtype: object

Statistics for each column:
       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000